using System.Dynamic;
using WorkProj.Entity;
using WorkProj.Entity.Entity;

namespace WorkProj.Services
{
    /// <summary>
    /// Клас для ініціалізації бази даних книжок
    /// </summary>
    public static class DbInitializer
    {
        /// <summary>
        /// Об'єкт класу ILogger для логування подій 
        /// </summary>
        /// 
        private static readonly ILogger _logger = LoggerFactory.Create(builder => builder.AddConsole())
            .CreateLogger(typeof(DbInitializer));

        /// <summary>
        /// Ініціалізує базу даних автомобільного продажу.
        /// </summary>
        public static void Initialize(DBContext context)
        {
            context.Database.EnsureCreated();

            _logger.LogInformation("Успішно перевірино чи база даних є створена");

            if (context.Books.Any())
            {
                _logger.LogInformation("В базі даних уже є книжки");
                return;
            }

            _logger.LogInformation("В базі даних немає книжок");

            var books = new List<Book>
            {
                new Book
                {
                    Author = "Леся Українка",
                    Title = "Книга Мавка. Лісова пісня. Переказ для дітей.",
                    Distributor = "Ранок",
                    Description = "«Будь-де буде краще, ніж тут. Ти будеш у безпеці, доки триматимешся якнайдалі від Галанта». Олівія Пріор — сирота, вона мешкає в школі для дівчат Меріленс. Єдина річ, яку залишила їй матір — божевільний щоденник, що приховує багато таємниць. Одного дня дівчина отримує дивний лист із запрошенням повернутися додому — до маєтку Галант. Але коли Олівія з’являється на порозі — розуміє, що нікому тут не потрібна. Дівчина знає, що Галант приховує секрети, і сповнена рішучості розкрити їх. Якось вона знаходить зруйновану стіну, і опиняється по той бік Галанта, де на неї чекає уособлення зла — Згуба. Які ще випробування трапляться на її шляху? Чи віднайде вона в собі сили довідатися усі таємниці маєтку? ВІКТОРІЯ Е. ШВАБ є авторкою бестселерів за версією New York Times. Письменниця завершила понад двадцять книжок, серед яких відомі серії «Відтінки магії», «Кессіді Блейк», «Лиходії» і міжнародний бестселер «Незриме життя Адді Лярю». Її книжки перекладені більш ніж двома десятками мов.",
                    Isbn = "9789667510848",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/01.jpg",
                    NumberOfPages = 2023,
                    Size = "191х245 мм",
                    Price = 650,
                    OpinionsNumber = 2
                },
                new Book
                {
                    Author = "Василь Симоненко",
                    Title = "Краще знати про що пишеш",
                    Distributor = "Видавництво Книга",
                    Description = "Ця книжка розповідає про те, як важливо розуміти тему, про яку пишеш, та знати всі нюанси. Автор дає корисні поради та приклади зі своєї власної творчості.",
                    Isbn = "978-617-09-2222-2",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/02.jpg",
                    NumberOfPages = 350,
                    Size = "135 x 210 мм",
                    Price = 220,
                    OpinionsNumber = 5
                },
                new Book
                {
                    Author = "Агата Крісті",
                    Title = "Місіс Мак-Ґінті померла (Легендарний Пуаро)",
                    Distributor = "Видавництво А-БА-БА-ГА-ЛА-МА-ГА",
                    Description = "У цій книзі Агата Крісті продовжує пригоди знаменитого детектива Еркюля Пуаро. Цього разу він розслідує загадкову загибель місіс Мак-Ґінті.",
                    Isbn = "978-617-585-012-8",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/03.jpg",
                    NumberOfPages = 280,
                    Size = "145 x 215 мм",
                    Price = 220,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Ірина Говоруха",
                    Title = "Плахта. Книга 2. Південний схід",
                    Distributor = "Видавництво Фоліо",
                    Description = "У цій книзі продовжуються пригоди головного героя, який опинився у світі фантастичних подій та магії. Він відправляється на південний схід світу, де чекають на нього нові випробування.",
                    Isbn = "978-966-03-8320-5",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/04.jpg",
                    NumberOfPages = 480,
                    Size = "160 x 240 мм",
                    Price = 200,
                    OpinionsNumber = 11
                },
                new Book
                {
                    Author = "Іван Багряний",
                    Title = "Крокви над табором. Оповідання. Есеї",
                    Distributor = "Видавництво Смолоскип",
                    Description = "У цій книзі зібрані оповідання та есеї Івана Багряного, в яких він розкриває різні аспекти життя та людських взаємин.",
                    Isbn = "978-617-7238-00-2",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/05.jpg",
                    NumberOfPages = 320,
                    Size = "150 x 220 мм",
                    Price = 270,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Іван Багряний",
                    Title = "Оріон Золотий. Театр: п'єси",
                    Distributor = "Видавництво Альтерпрес",
                    Description = "У цій книзі зібрані п'єси Івана Багряного, які були поставлені на сцені відомих театрів. Це різноманітні твори, в яких автор розкриває різні теми та проблеми.",
                    Isbn = "978-617-629-798-3",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/06.jpg",
                    NumberOfPages = 240,
                    Size = "140 x 200 мм",
                    Price = 122,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Джіо С.",
                    Title = "На добраніч, Джун",
                    Distributor = "Видавництво Час Майстрів",
                    Description = "Ця книжка розповідає про захоплюючі пригоди головної героїні, яка живе у світі фантазій та чарівництва. Вона повинна знайти шлях додому та пережити багато небезпек.",
                    Isbn = "978-617-09-5544-4",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/07.jpg",
                    NumberOfPages = 160,
                    Size = "90 x 140 мм",
                    Price = 130,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Ілларіон Павлюк",
                    Title = "Танець недоумка",
                    Distributor = "Видавництво Кальварія",
                    Description = "У цій книзі Ілларіон Павлюк розповідає історію головного героя, який живе у світі музики та танцю. Він намагається знайти своє місце у цьому світі та розкрити свій талант.",
                    Isbn = "978-617-7695-62-5",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/08.jpg",
                    NumberOfPages = 256,
                    Size = "130 x 200 мм",
                    Price = 420,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Габріель Зевін",
                    Title = "Завтра, завтра, завтра...",
                    Distributor = "Видавництво Фоліо",
                    Description = "У цій книзі Габріель Зевін розповідає про пригоди головного героя, який живе у світі магії та загадок. Він змушений шукати відповіді на багато запитань та розкрити секрети свого походження.",
                    Isbn = "978-617-7525-80-4",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/09.jpg",
                    NumberOfPages = 304,
                    Size = "150 x 230 мм",
                    Price = 320,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Принц Гаррі",
                    Title = "Запасний.",
                    Distributor = "Видавництво Критика",
                    Description = "У цих мемуарах принц Гаррі, герцог Сассекський, розповідає про своє життя, родину та важливі події, які вплинули на його долю. Він ділиться своїми думками та переживаннями.",
                    Isbn = "978-617-7807-14-7",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/10.jpg",
                    NumberOfPages = 400,
                    Size = "160 x 240 мм",
                    Price = 550,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Ніта Проуз",
                    Title = "Покоївка",
                    Distributor = "Видавництво Химера",
                    Description = "У цій книзі Ніта Проуз розповідає історію покоївки, яка працює в одній з великих родин. Вона стикається зі складнощами та викликами своєї професії, але знаходить силу йти вперед.",
                    Isbn = "978-617-7770-46-0",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/11.jpg",
                    NumberOfPages = 352,
                    Size = "140 x 200 мм",
                    Price = 399,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "С’юзі Годж",
                    Title = "Коротка історія мистецтва",
                    Distributor = "Видавництво Астролябія",
                    Description = "У цій книзі С’юзі Годж розповідає про розвиток мистецтва від найдавніших часів до сучасності. Вона розкриває основні напрямки, стилі та впливових митців.",
                    Isbn = "978-617-12-4623-0",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/12.jpg",
                    NumberOfPages = 224,
                    Size = "160 x 240 мм",
                    Price = 420,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Елізабет Гілберт",
                    Title = "Природа всіх речей",
                    Distributor = "Видавництво Книжковий Клуб 'Клуб Сімейного Дозвілля'",
                    Description = "У цій книзі Елізабет Гілберт розповідає історію головної героїні, яка зустрічає та втрачає кохання. Вона вирушає у подорож світом, щоб знайти себе та знайти місце, де її серце буде належати.",
                    Isbn = "978-617-7859-05-7",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/13.jpg",
                    NumberOfPages = 464,
                    Size = "145 x 215 мм",
                    Price = 456,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Шваб",
                    Title = "Галант",
                    Distributor = "Видавництво Фоліо",
                    Description = "У цій книзі Шваб розповідає історію головного героя, який вирушає у захоплюючу подорож через час. Він зустрічається зі своїми минулими втіленнями та стикається з важливими життєвими виборами.",
                    Isbn = "978-966-03-9431-4",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/14.jpg",
                    NumberOfPages = 480,
                    Size = "145 x 215 мм",
                    Price = 522,
                    OpinionsNumber = 7
                },
                new Book
                {
                    Author = "Любов Якимчук",
                    Title = "Абрикоси Донбасу",
                    Distributor = "Видавництво Старого Лева",
                    Description = "У цій книзі Любов Якимчук зібрала свої поезії, присвячені Донбасу. Вона висловлює свої думки та почуття щодо війни, руйнування та втрати.",
                    Isbn = "978-617-7766-52-3",
                    Year = 2023,
                    Language = "Українська мова",
                    CoverOfBook = "Тверда",
                    ImageUrl = "img/15.jpg",
                    NumberOfPages = 120,
                    Size = "130 x 200 мм",
                    Price = 250,
                    OpinionsNumber = 7
                }

            };

            _logger.LogInformation("Додання кожної книжки");
            foreach (var book in books)
            {
                context.Books.Add(book);
            }

            context.SaveChanges();

            _logger.LogInformation("Книжки були успішно додані");
        }
    }
}
